"""
피보나치 수열

memoization 기법 사용
    한번 구한 결과를 메모리 공간에 메모해두고 같은 식을 다시 호출하면 메모한 결과를 그대로 가져오는 기법
    caching 이라고도 함
"""
### Top-Down 방식
# 한 번 계산된 결과를 memoization하기 위한 리스트 초기화
d=[0]*100 

# 피보나치 함수를 재귀함수로 구현(탑다운 다이나믹 프로그래밍)
def fibo(x):
    # 종료 조건(1 or 2일 때 1 반환)
    if x==1 or x==2:
        return 1
    # 이미 계산한 적 있는 문제라면 그대로 반환
    if d[x]!=0:
        return d[x]
    # 아직 계산하지 않은 문제라면 점화식에 따라서 피보나치 결과 반환
    d[x]=fibo(x-1)+fibo(x-2)
    return d[x]
print(fibo(99))


### Bottom-Up 방식
# 앞서 계산된 결과를 저장히기 위한 DP 테이블 초기화
d=[0]*100

# 첫 번째 피보나치 수와 두 번째 피보나치 수는 1
d[1]=1
d[2]=1

# 피보나치 함수 반복문으로 구현
for i in range(3,100):
    d[i]=d[i-1]+d[i-2]
print(d[-1])